netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_getAll_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>https://webservices.na1.netsuite.com/services/NetSuitePort_2014_1</urn:apiUrl>
        <urn:method>getAll</urn:method>
        <urn:warningAsError>true</urn:warningAsError>
        <urn:disableMandatoryCustomFieldValidation>false</urn:disableMandatoryCustomFieldValidation>
        <urn:disableSystemNotesForCustomFields>true</urn:disableSystemNotesForCustomFields>
        <urn:ignoreReadOnlyFields>true</urn:ignoreReadOnlyFields>
        <urn:partnerId></urn:partnerId>
        <urn:applicationId></urn:applicationId>
        <urn:email>%s(email)</urn:email>
        <urn:password>%s(password)</urn:password>
        <urn:account>%s(account)</urn:account>
        <urn:roleInternalId></urn:roleInternalId>
        <urn:roleExternalId></urn:roleExternalId>
        <urn:roleType></urn:roleType>
        <urn:roleName></urn:roleName>
        <urn:record>
            <platformMsgs:record recordType="state"
                                 xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com"/>
        </urn:record>
    </soapenv:Body>
</soapenv:Envelope>